# Taps
tap "derailed/k9s"
tap "romkatv/powerlevel10k"

# Shells
brew "zsh"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "nushell"

# Shell utilities
brew "wget"
brew "tree"
brew "vim"
brew "neovim"
brew "ripgrep"

# Dev tools
brew "git"

# Containers
brew "colima"
brew "docker"
brew "derailed/k9s/k9s"
brew "argocd"
brew "kubectl"
brew "helm"

# Cloud CLIs
brew "awscli"
brew "azure-cli"

# Programming languages
brew "python"
brew "pyenv"
brew "go"
brew "rust"
brew "jenv"
brew "openjdk@11"
brew "openjdk@17"
brew "maven"

# AI
brew "ollama"

# Applications
cask "iterm2"
cask "visual-studio-code"
cask "obsidian"
cask "arc"
cask "font-hack-nerd-font"
cask "tomighty"
